# FBXExportOptions Properties

---
The FBXExportOptions type exposes the following members.
| Name| Description
---|---|---
| LevelsOfDetailValue| The value of the levels of detail.
| StopOnError| Whether export process should stop when a view fails to export.
| UseLevelsOfDetail| True to use levels of detail, false otherwise.
| WithoutBoundaryEdges| True to export without boundary edges, false otherwise.
Top
#### Reference
FBXExportOptions Class
Autodesk.Revit.DB Namespace